import { defineConfig } from 'vitepress'

// https://vitepress.dev/reference/site-config
export default defineConfig({
  lang: 'zh-CN',
  title: 'MOD教程文档',
  head: [["link", { rel: "icon", href: "/MOD-TechDoc/favicon.png" }]],
  description: 'A VitePress Site',
  base: '/MOD-TechDoc/', // 部署路径
  themeConfig: {
    // https://vitepress.dev/reference/default-theme-config
    // 搜索配置
    search: {
      provider: 'local',
      options: {
        translations: {
          button: {
            buttonText: '搜索文档',
            buttonAriaLabel: '搜索文档'
          },
          modal: {
            noResultsText: '没有找到结果',
            resetButtonTitle: '重置搜索',
            footer: {
              selectText: '选择',
              navigateText: '导航',
              closeText: '关闭'
            }
          }
        }
      }
    },

    // 导航栏
    nav: [
      { text: '主页', link: '/' },
      { text: '快速指南', link: '/快速指南/板块概述' },
      { text: '环境配置', link: '/环境配置/板块概述' },
      { text: '基础MOD教程', link: '/基础MOD教程/板块概述' },
      { text: '进阶MOD教程', link: '/进阶MOD教程/板块概述' },
      { text: '未归档', link: '/未归档/板块概述' }
    ],
    // 侧边栏（为每个一级导航路径配置独立的侧边栏）
    sidebar: {
      '/快速指南/': [
        {
          text: '快速指南',
          items: [
            { text: '板块概述', link: '/快速指南/板块概述' },
            { text: '本站说明', link: '/快速指南/本站说明' },
            { text: '使用方法', link: '/快速指南/使用方法' },
            { text: '网站整合', link: '/快速指南/网站整合' },
            //{ text: 'XXX', link: '/快速指南/XXX' }
          ]
        }
      ],
      '/环境配置/': [
        {
          text: '环境配置',
          items: [
            { text: '板块概述', link: '/环境配置/板块概述' },
            { text: '游玩环境配置', link: '/环境配置/游玩环境配置' },
            { text: '开发环境配置', link: '/环境配置/开发环境配置' }
          ]
        }
      ],
      '/基础MOD教程/': [
        {
          text: '板块概述',
          items: [
            { text: '板块概述', link: '/基础MOD教程/板块概述' }
          ]
        },
        {
          text: '前置准备',
          items: [
            { text: '前置准备', link: '/基础MOD教程/前置准备' }
          ]
        },
        {
          text: '软件管理',
          items: [
            { text: '软件管理', link: '/基础MOD教程/软件管理' }
          ]
        }
      ],
      '/进阶MOD教程/': [
        {
          text: '进阶MOD教程',
          items: [
            { text: '板块概述', link: '/进阶MOD教程/板块概述' },
            { text: '配置文件文档', link: '/进阶MOD教程/配置文件文档' },
            { text: '贴图通道文档', link: '/进阶MOD教程/贴图通道文档' },
            { text: '着色联动文档', link: '/进阶MOD教程/着色联动文档' },
            { text: '可视化面板文档', link: '/进阶MOD教程/可视化面板文档' }
          ]
        }
      ],
      '/未归档/': [
        {
          text: '未归档',
          items: [
            { text: '板块概述', link: '/未归档/板块概述' },
            //{ text: '待填充', link: '/未归档/待填充' }
          ]
        }
      ]
    },

    // 社交链接
    socialLinks: [
      { icon: 'github', link: 'https://github.com/ZelbertYQ/MOD-TechDoc' },
      { icon: 'bilibili', link: 'https://space.bilibili.com/435289515' },
      { icon: 'gamebanana', link: 'https://gamebanana.com/members/3447428' },
      //{ icon: 'partreon', link: 'https://gamebanana.com/members/3447428' },
      {
        icon: {
          svg: `<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 75 75"><title>Caimogu</title><defs><style>.cls-1{fill:#fcf4f5}.cls-2{fill:none}.cls-3{fill:#db4a6a}.cls-4{fill:#dd5473}.cls-5{fill:#fbf1f3}.cls-6{fill:#fbeff1}.cls-7{fill:none}.cls-8{fill:#261b18}.cls-9{fill:#faebee}</style></defs><path class="cls-3" d="M48.27,0c1.73,0,3.47,0,5.2,0,9.71,3.18,14.12,10.63,16.51,19.97,1.35,5.31,3.33,10.46,5.03,15.68v11.14c-3.82,6.88-7.82,8.34-14.91,4.76-4.17-2.11-8-4.89-11.92-7.47-5.52-3.64-14.82-3.61-20.32,0-4.23,2.77-8.39,5.78-12.94,7.9-7.94,3.7-14.57-.57-14.02-9.33.76-12.21,4.87-23.63,10.32-34.54.43-.87,1.05-1.79,1.83-2.31C16.05,3.78,19.18,1.92,22.28,0c.5,0,.99,0,1.49,0,1.27.25,2.54.69,3.82.71,5.49.08,10.99.08,16.49,0,1.4-.02,2.8-.46,4.2-.71ZM28.21,21.23c-.11.08-.23.15-.34.23-1.11-1.94-2.16-5.48-3.34-5.53-4.06-.16-1.91,4.18-3.26,6.21-.21-.24-.41-.49-.62-.73-1.61,1.16-3.23,2.32-4.84,3.48,1.66,1.4,3.33,2.79,5.35,4.49.75,1.33,1.86,3.29,2.97,5.26,1.33-2.01,2.67-4.01,3.81-5.74,1.79-1.22,3.52-2.42,5.25-3.61-1.66-1.36-3.32-2.71-4.98-4.07Z"/><path class="cls-7" d="M22.28,0c-3.09,1.92-6.22,3.78-9.25,5.79-.78.52-1.4,1.44-1.83,2.31C5.75,19.01,1.64,30.43.88,42.64c-.55,8.76,6.08,13.02,14.02,9.33,4.56-2.12,8.71-5.13,12.94-7.9,5.51-3.6,14.8-3.63,20.32,0,3.92,2.58,7.75,5.37,11.92,7.47,7.09,3.58,11.09,2.12,14.91-4.76v28.22H0V0C7.43,0,14.85,0,22.28,0ZM14.89,56.18c1.04,3.17,1.9,6.4,3.15,9.46,2.14,5.24,6.08,8.37,11.85,8.56,5.3.18,10.61.12,15.92,0,4.76-.11,8.79-2,10.9-6.41,1.84-3.82,3.07-7.94,4.45-11.59-4.94-3.29-9.35-6.22-13.74-9.17-4.44-2.98-14.25-3.05-18.71-.08-4.5,3-9,6.01-13.82,9.23Z"/><path class="cls-2" d="M75,35.64c-1.7-5.22-3.68-10.37-5.03-15.68C67.59,10.63,63.18,3.18,53.47,0h21.53v35.64Z"/><path class="cls-4" d="M48.27,0c-1.4.25-2.8.69-4.2.71-5.49.08-10.99.08-16.49,0C26.31.69,25.04.25,23.76,0,31.93,0,40.1,0,48.27,0Z"/><path class="cls-5" d="M28.21,21.23c1.66,1.36,3.32,2.71,4.98,4.07-1.73,1.19-3.47,2.38-5.25,3.61-1.14,1.72-2.48,3.73-3.81,5.74-1.11-1.97-2.22-3.93-2.97-5.26-2.02-1.69-3.68-3.09-5.35-4.49l4.84-3.48c.21.24.41.49.62.73,1.35-2.03-.8-6.37,3.26-6.21,1.18.05,2.23,3.59,3.34,5.53.11-.08.23-.15.34-.23Z"/><path class="cls-9" d="M53.5,23.15c-1.32-1.87-2.72-2.99-2.67-4.03.05-1.09,1.5-2.12,2.33-3.17,1.03,1,2.64,1.88,2.89,3.05.2.92-1.28,2.21-2.55,4.16Z"/><path class="cls-6" d="M53.42,35.65c-1.33-2.04-2.7-3.22-2.57-4.21.13-1.07,1.66-1.98,2.58-2.96.93.97,2.48,1.87,2.61,2.95.12.99-1.27,2.17-2.61,4.22Z"/><path class="cls-6" d="M47.94,29.6c-1.39-2.1-2.71-3.21-2.64-4.22.08-1.08,1.48-2.07,2.3-3.1.94.93,2.49,1.75,2.65,2.8.16,1.02-1.08,2.27-2.32,4.52Z"/><path class="cls-1" d="M62.97,25.41c-1.96,1.28-3.24,2.74-4.09,2.52-1.01-.26-2.19-1.93-2.27-3.05-.05-.81,1.64-2.47,2.47-2.41,1.07.07,2.06,1.46,3.9,2.95Z"/><path class="cls-8" d="M14.89,56.18c4.82-3.22,9.32-6.24,13.82-9.23,4.46-2.97,14.27-2.9,18.71.08,4.39,2.95,8.8,5.88,13.74,9.17-1.38,3.65-2.61,7.77-4.45,11.59-2.12,4.4-6.14,6.29-10.90,6.41-5.3.13-10.62.18-15.92,0-5.77-.19-9.71-3.32-11.85-8.56-1.26-3.07-2.11-6.3-3.15-9.46Z"/></svg>`
        },
        link: 'https://www.caimogu.cc/circle/440.html',
        ariaLabel: 'Caimogu 社区'
      }
    ],

    // 本地化翻译字段（直接放在 themeConfig 中）
    editLink: {
      text: '编辑此页',
      pattern: 'https://github.com/ZelbertYQ/MOD-TechDoc/edit/main/docs/:path'
    },
    lastUpdated: {
      text: '最后更新于',
      formatOptions: {
        dateStyle: 'full',
        timeStyle: 'medium'
      }
    },
    docFooter: {
      prev: '上一页',
      next: '下一页'
    },
    darkModeSwitchLabel: '切换主题',
    sidebarMenuLabel: '菜单',
    returnToTopLabel: '返回顶部',
    langMenuLabel: '切换语言',
    notFound: {
      title: '页面未找到',
      quote: '抱歉，页面不存在。',
      linkText: '返回主页'
    },
    outlineTitle: '页面导航',
    //页脚
    footer: {
      message: '不辨真伪，勿论虚实',
      copyright: '囿于求知，身陷囹圄'
    }
  }
})