import { defineConfig } from 'vitepress'


//npm run docs:dev
// https://vitepress.dev/reference/site-config
export default defineConfig({
  lang: 'zh-CN',
  title: 'Zelbert的技术文档',
  head: [["link", { rel: "icon", href: "/MOD-TechDoc/favicon.png" }]],
  description: 'A VitePress Site',
  base: '/MOD-TechDoc/', // 部署路径
  themeConfig: {
    // https://vitepress.dev/reference/default-theme-config
    // 搜索配置
    search: {
      provider: 'local',
      options: {
        translations: {
          button: {
            buttonText: '搜索文档',
            buttonAriaLabel: '搜索文档'
          },
          modal: {
            noResultsText: '没有找到结果',
            resetButtonTitle: '重置搜索',
            footer: {
              selectText: '选择',
              navigateText: '导航',
              closeText: '关闭'
            }
          }
        }
      }
    },

    // 导航栏
    nav: [
      { text: '主页', link: '/' },
      {
        text: 'MOD技术文档',
        items: [
          { text: '📚 快速指南', link: '/A1.快速指南/A1-1.快速指南概述' },
          { text: '⚙️ 环境配置', link: '/A2.环境配置/A2-1.环境配置概述' },
          { text: '🎯 基础MOD教程', link: '/A3.基础MOD教程/A3-1.基础MOD教程概述' },
          { text: '🚀 进阶MOD教程', link: '/A4.进阶MOD教程/A4-1.进阶MOD教程概述' },
          { text: '📦 未归档', link: '/A5.未归档/A5-1.未归档概述' }
        ]
      },
      {
        text: '学习笔记',
        items: [
          { text: '📚 项目语法', link: '/A6.学习笔记/B1.项目语法/B1-1.项目语法概述' }
          //{ text: '📝 C# 语法', link: '/A6.学习笔记/A6-2.Markdown语法' },
          //{ text: '🛠️ Unity 笔记', link: '/A6.学习笔记/A6-3.VitePress语法' }
        ]
      }
    ],
    // 侧边栏（为每个一级导航路径配置独立的侧边栏）
    sidebar: {
      '/A1.快速指南/': [
        {
          //text: '快速指南',
          //collapsed: false,
          items: [
            { text: '快速指南概述', link: '/A1.快速指南/A1-1.快速指南概述' }
          ]
        },
        {
          text: '快速指南',
          //collapsed: false,
          items: [
            //{ text: '板块概述', link: '/A1.快速指南/A1-1.板块概述' },
            { text: '本站说明', link: '/A1.快速指南/A1-2.本站说明' },
            { text: '使用方法', link: '/A1.快速指南/A1-3.使用方法' },
            { text: '网站整合', link: '/A1.快速指南/A1-4.网站整合' }
          ]
        }
      ],
      '/A2.环境配置/': [
        {
          //text: '环境配置概述',
          //collapsed: false,
          items: [
            { text: '环境配置概述', link: '/A2.环境配置/A2-1.环境配置概述' }
          ]
        },
        {
          text: '游玩环境配置',
          //collapsed: false,
          items: [
            {
              text: '本地环境',
              //collapsed: false,
              items: [
                { text: '电脑环境', link: '/A2.环境配置/B1.游玩环境配置/C1.本地环境/C1-1.电脑环境' },
                { text: '游戏环境', link: '/A2.环境配置/B1.游玩环境配置/C1.本地环境/C1-2.游戏环境' }
              ]
            },
            {
              text: 'MOD加载器',
              //collapsed: false,
              items: [
                { text: '散装加载器', link: '/A2.环境配置/B1.游玩环境配置/C2.MOD加载器/C2-1.散装加载器' },
                { text: '整合加载器', link: '/A2.环境配置/B1.游玩环境配置/C2.MOD加载器/C2-2.整合加载器' }
              ]
            },
            {
              text: 'MOD管理器',
              //collapsed: false,
              items: [
                { text: '手动管理', link: '/A2.环境配置/B1.游玩环境配置/C3.MOD管理器/C3-1.手动管理' },
                { text: '自动管理', link: '/A2.环境配置/B1.游玩环境配置/C3.MOD管理器/C3-2.自动管理' }
              ]
            }
          ]
        },
        {
          text: '制作开发环境配置',
          //collapsed: false,
          items: [
            {
              text: '制作环境配置',
              //collapsed: false,
              items: [
                { text: 'XXMI', link: '/A2.环境配置/B2.制作开发环境配置/C1.制作环境配置/C1-1.XXMI' },
                { text: 'Blender', link: '/A2.环境配置/B2.制作开发环境配置/C1.制作环境配置/C1-2.Blender' },
                { text: 'Paint.NET', link: '/A2.环境配置/B2.制作开发环境配置/C1.制作环境配置/C1-3.Paint.NET' }
                //{ text: 'VSCode插件', link: '/基础MOD教程/前置准备/软件相关/Blender/Blender基础' }
              ]
            },
            {
              text: '开发环境配置',
              //collapsed: false,
              items: [
                { text: '技术栈', link: '/A2.环境配置/B2.制作开发环境配置/C2.开发环境配置/C2-1.技术栈' },
                { text: 'VSCode', link: '/A2.环境配置/B2.制作开发环境配置/C2.开发环境配置/C2-2.VSCode' }
                //{ text: 'VSCode', link: '/环境配置/制作开发环境配置/开发环境配置/VSCode' }
              ]
            },
            {
              text: '配套插件安装',
              //collapsed: false,
              items: [
                { text: 'Blender', link: '/A2.环境配置/B2.制作开发环境配置/C3.配套插件安装/C3-1.Blender' },
                { text: 'Paint.NET', link: '/A2.环境配置/B2.制作开发环境配置/C3.配套插件安装/C3-2.Paint.NET' },
                { text: 'VSCode', link: '/A2.环境配置/B2.制作开发环境配置/C3.配套插件安装/C3-3.VSCode' }
              ]
            }
          ]
        }
      ],
      '/A3.基础MOD教程/': [
        {
          //text: '教程概述',
          //collapsed: false,
          items: [
            { text: '基础MOD教程概述', link: '/A3.基础MOD教程/A3-1.基础MOD教程概述' }
          ]
        },
        {
          text: '文件解析',
          //collapsed: false,
          items: [
            { text: '后缀解析',link: '/A3.基础MOD教程/B1.文件解析/B1-1.后缀解析' },
            { text: '缩写解析',link: '/A3.基础MOD教程/B1.文件解析/B1-2.缩写解析' },
            { text: '功能解析', link: '/A3.基础MOD教程/B1.文件解析/B1-3.功能解析' }
            //{ text: '资产管理', link: '/基础MOD教程/前置准备/资产管理' },
          ]
        },
        {
          text: '基础模型替换',
          //collapsed: false,
          items: [
            { text: '转储导入',link: '/A3.基础MOD教程/B2.基础模型替换/B2-1.转储导入' },
            { text: '数据匹配',link: '/A3.基础MOD教程/B2.基础模型替换/B2-2.数据匹配' },
            { text: '合并导出', link: '/A3.基础MOD教程/B2.基础模型替换/B2-3.合并导出' }
            //{ text: '资产管理', link: '/基础MOD教程/前置准备/资产管理' },
          ]
        },
        {
          text: '完整面部替换',
          //collapsed: false,
          items: [
            { text: '形态键配置',link: '/A3.基础MOD教程/B3.完整面部替换/B3-1.形态键配置' },
            {
              text: '光照配置',
              //collapsed: false,
              items: [
                { text: '原生光照',link: '/A3.基础MOD教程/B3.完整面部替换/C1.光照配置/C1-1.原生光照' },
                { text: '自定义光照',link: '/A3.基础MOD教程/B3.完整面部替换/C1.光照配置/C1-2.自定义光照' }
                //{ text: '合并导出', link: '/基础MOD教程/前置准备/软件相关/Blender/Blender基础' }
                //{ text: '资产管理', link: '/基础MOD教程/前置准备/资产管理' },
              ]
            }
            //{ text: '资产管理', link: '/基础MOD教程/前置准备/资产管理' },
          ]
        }
      ],
      '/A4.进阶MOD教程/': [
        {
          //text: '教程概述',
          //collapsed: false,
          items: [
            { text: '进阶MOD教程概述', link: '/A4.进阶MOD教程/A4-1.进阶MOD教程概述' }
          ]
        },
        {
          text: '颜色通道',
          collapsed: false,
          items: [
            // { text: 'COLOR', link: '/进阶MOD教程/配置文件文档' },
            // { text: 'COLOR1', link: '/进阶MOD教程/贴图通道文档' },
            {
              text: '颜色属性',
              //collapsed: false,
              items: [
                { text: 'COLOR', link: '/A4.进阶MOD教程/B1.颜色通道/C1.颜色属性/C1-1.COLOR' },
                { text: 'COLOR1', link: '/A4.进阶MOD教程/B1.颜色通道/C1.颜色属性/C1-2.COLOR1' }
              ]
            },
            {
              text: '贴图通道',
              //collapsed: false,
              items: [
                { text: '漫反射贴图', link: '/A4.进阶MOD教程/B1.颜色通道/C2.贴图通道/C2-1.漫反射贴图' },
                { text: '材质贴图', link: '/A4.进阶MOD教程/B1.颜色通道/C2.贴图通道/C2-2.材质贴图' },
                { text: '法线贴图', link: '/A4.进阶MOD教程/B1.颜色通道/C2.贴图通道/C2-3.法线贴图' },
                { text: '高光贴图', link: '/A4.进阶MOD教程/B1.颜色通道/C2.贴图通道/C2-4.高光贴图' },
                { text: '特效贴图', link: '/A4.进阶MOD教程/B1.颜色通道/C2.贴图通道/C2-5.特效贴图' },
                { text: '遮罩贴图', link: '/A4.进阶MOD教程/B1.颜色通道/C2.贴图通道/C2-6.遮罩贴图' }
              ]
            },
          ]
        },
        {
          text: '配置文件',
          collapsed: false,
          items: [
            {
              text: '代码节',
              //collapsed: false,
              items: [
                {
                  text: '基础',
                  //collapsed: false,
                  items: [
                    { text: '[Constants]', link: '/A4.进阶MOD教程/B2.配置文件/C1.代码节/D1.基础/D1-1.Constants' },
                    { text: '[Present]', link: '/A4.进阶MOD教程/B2.配置文件/C1.代码节/D1.基础/D1-2.Present' },
                    { text: '[Resource_Name]', link: '/A4.进阶MOD教程/B2.配置文件/C1.代码节/D1.基础/D1-3.Resource_Name' },
                    //{ text: '[Key_Name]', link: '/进阶MOD教程/配置文件文档' },
                    { text: '[TextureOverride_Name]', link: '/A4.进阶MOD教程/B2.配置文件/C1.代码节/D1.基础/D1-4.TextureOverride_Name' },
                    { text: '[ShadereOverride_Name]', link: '/A4.进阶MOD教程/B2.配置文件/C1.代码节/D1.基础/D1-5.ShadereOverride_Name' }
                  ]
                },
                {
                  text: '进阶',
                  //collapsed: false,
                  items: [
                    //{ text: '操作符', link: '/进阶MOD教程/配置文件文档' },
                    { text: '[Key_Name]', link: '/A4.进阶MOD教程/B2.配置文件/C1.代码节/D2.进阶/D2-1.Key_Name' },
                    { text: '[CommandList_Name]', link: '/A4.进阶MOD教程/B2.配置文件/C1.代码节/D2.进阶/D2-2.CommandList_Name' }
                   // { text: '[ShaderRegexDiffuse]', link: '/进阶MOD教程/配置文件文档' },
                    //{ text: '通道解释', link: '/进阶MOD教程/贴图通道文档' }
                  ]
                },
                {
                  text: '超纲',
                  //collapsed: false,
                  items: [
                    { text: '着色器正则匹配', link: '/A4.进阶MOD教程/B2.配置文件/C1.代码节/D3.超纲/D3-1.着色器正则匹配' }
                    //{ text: '[ShaderRegex_Name]', link: '/进阶MOD教程/配置文件文档' },
                    //{ text: '[ShaderRegex_Name.Pattern]', link: '/进阶MOD教程/配置文件文档' },
                    //{ text: '[ShaderRegex_Name.Pattern.Replace]', link: '/进阶MOD教程/配置文件文档' },
                    //{ text: '[ShaderRegex_Name.InsertDeclarations]', link: '/进阶MOD教程/贴图通道文档' }
                  ]
                },
              ]
            },
            {
              text: '键值对',
              //collapsed: false,
              items: [
                { text: '赋值', link: '/A4.进阶MOD教程/B2.配置文件/C2.键值对/C2-1.赋值' },
                { text: '配置', link: '/A4.进阶MOD教程/B2.配置文件/C2.键值对/C2-2.配置' },
                { text: '关联', link: '/A4.进阶MOD教程/B2.配置文件/C2.键值对/C2-3.关联' }
                //{ text: '处理', link: '/进阶MOD教程/可视化面板文档' }
              ]
            },
          ]
        },
        {
          text: '着色修改',
          //collapsed: false,
          items: [
            { text: '简单修改', link: '/A4.进阶MOD教程/B3.着色修改/B3-1.简单修改' },
            { text: '接口调用', link: '/A4.进阶MOD教程/B3.着色修改/B3-2.接口调用' },
            { text: '高级着色语言', link: '/A4.进阶MOD教程/B3.着色修改/B3-3.高级着色语言' },
            { text: '汇编语言', link: '/A4.进阶MOD教程/B3.着色修改/B3-4.汇编语言' }
          ]
        },
        {
          text: '交互面板',
          //collapsed: false,
          items: [
            { text: '解构', link: '/A4.进阶MOD教程/B4.交互面板/B4-1.解构' },
            { text: '重塑', link: '/A4.进阶MOD教程/B4.交互面板/B4-2.重塑' },
            { text: '封装', link: '/A4.进阶MOD教程/B4.交互面板/B4-3.封装' }
          ]
        }
      ],
      '/A5.未归档/': [
        {
          //text: '着色调用',
          //collapsed: false,
          items: [
            { text: '未归档概述', link: '/A5.未归档/A5-1.未归档概述' }
          ]
        }
      ],
      '/A6.学习笔记/': [
        {
          //text: '快速指南',
          //collapsed: false,
          items: [
            { text: '项目语法概述', link: '/A6.学习笔记/B1.项目语法/B1-1.项目语法概述' }
          ]
        },
        {
          text: '项目语法',
          //collapsed: false,
          items: [
          //{ text: '📚 学习笔记概述', link: '/A6.语法笔记/A6-1.语法笔记概述' },
          { text: '🛠️ VitePress语法', link: '/A6.学习笔记/B1.项目语法/B1-2.Vitepress语法' },
          { text: '📝 Markdown语法', link: '/A6.学习笔记/B1.项目语法/B1-3.MarkDown语法' },
          { text: '💻 JavaScript语法', link: '/A6.学习笔记/B1.项目语法/B1-4.JavaScript语法' }
          ]
        }
      ]
    },

    // 社交链接
    socialLinks: [
      { icon: 'github', link: 'https://github.com/ZelbertYQ/MOD-TechDoc' },
      { icon: 'bilibili', link: 'https://space.bilibili.com/435289515' },
      { icon: 'gamebanana', link: 'https://gamebanana.com/members/3447428' },
      //{ icon: 'partreon', link: 'https://gamebanana.com/members/3447428' },
      {
        icon: {
          svg: `<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 75 75"><title>Caimogu</title><defs><style>.cls-1{fill:#fcf4f5}.cls-2{fill:none}.cls-3{fill:#db4a6a}.cls-4{fill:#dd5473}.cls-5{fill:#fbf1f3}.cls-6{fill:#fbeff1}.cls-7{fill:none}.cls-8{fill:#261b18}.cls-9{fill:#faebee}</style></defs><path class="cls-3" d="M48.27,0c1.73,0,3.47,0,5.2,0,9.71,3.18,14.12,10.63,16.51,19.97,1.35,5.31,3.33,10.46,5.03,15.68v11.14c-3.82,6.88-7.82,8.34-14.91,4.76-4.17-2.11-8-4.89-11.92-7.47-5.52-3.64-14.82-3.61-20.32,0-4.23,2.77-8.39,5.78-12.94,7.9-7.94,3.7-14.57-.57-14.02-9.33.76-12.21,4.87-23.63,10.32-34.54.43-.87,1.05-1.79,1.83-2.31C16.05,3.78,19.18,1.92,22.28,0c.5,0,.99,0,1.49,0,1.27.25,2.54.69,3.82.71,5.49.08,10.99.08,16.49,0,1.4-.02,2.8-.46,4.2-.71ZM28.21,21.23c-.11.08-.23.15-.34.23-1.11-1.94-2.16-5.48-3.34-5.53-4.06-.16-1.91,4.18-3.26,6.21-.21-.24-.41-.49-.62-.73-1.61,1.16-3.23,2.32-4.84,3.48,1.66,1.4,3.33,2.79,5.35,4.49.75,1.33,1.86,3.29,2.97,5.26,1.33-2.01,2.67-4.01,3.81-5.74,1.79-1.22,3.52-2.42,5.25-3.61-1.66-1.36-3.32-2.71-4.98-4.07Z"/><path class="cls-7" d="M22.28,0c-3.09,1.92-6.22,3.78-9.25,5.79-.78.52-1.4,1.44-1.83,2.31C5.75,19.01,1.64,30.43.88,42.64c-.55,8.76,6.08,13.02,14.02,9.33,4.56-2.12,8.71-5.13,12.94-7.9,5.51-3.6,14.8-3.63,20.32,0,3.92,2.58,7.75,5.37,11.92,7.47,7.09,3.58,11.09,2.12,14.91-4.76v28.22H0V0C7.43,0,14.85,0,22.28,0ZM14.89,56.18c1.04,3.17,1.9,6.4,3.15,9.46,2.14,5.24,6.08,8.37,11.85,8.56,5.3.18,10.61.12,15.92,0,4.76-.11,8.79-2,10.9-6.41,1.84-3.82,3.07-7.94,4.45-11.59-4.94-3.29-9.35-6.22-13.74-9.17-4.44-2.98-14.25-3.05-18.71-.08-4.5,3-9,6.01-13.82,9.23Z"/><path class="cls-2" d="M75,35.64c-1.7-5.22-3.68-10.37-5.03-15.68C67.59,10.63,63.18,3.18,53.47,0h21.53v35.64Z"/><path class="cls-4" d="M48.27,0c-1.4.25-2.8.69-4.2.71-5.49.08-10.99.08-16.49,0C26.31.69,25.04.25,23.76,0,31.93,0,40.1,0,48.27,0Z"/><path class="cls-5" d="M28.21,21.23c1.66,1.36,3.32,2.71,4.98,4.07-1.73,1.19-3.47,2.38-5.25,3.61-1.14,1.72-2.48,3.73-3.81,5.74-1.11-1.97-2.22-3.93-2.97-5.26-2.02-1.69-3.68-3.09-5.35-4.49l4.84-3.48c.21.24.41.49.62.73,1.35-2.03-.8-6.37,3.26-6.21,1.18.05,2.23,3.59,3.34,5.53.11-.08.23-.15.34-.23Z"/><path class="cls-9" d="M53.5,23.15c-1.32-1.87-2.72-2.99-2.67-4.03.05-1.09,1.5-2.12,2.33-3.17,1.03,1,2.64,1.88,2.89,3.05.2.92-1.28,2.21-2.55,4.16Z"/><path class="cls-6" d="M53.42,35.65c-1.33-2.04-2.7-3.22-2.57-4.21.13-1.07,1.66-1.98,2.58-2.96.93.97,2.48,1.87,2.61,2.95.12.99-1.27,2.17-2.61,4.22Z"/><path class="cls-6" d="M47.94,29.6c-1.39-2.1-2.71-3.21-2.64-4.22.08-1.08,1.48-2.07,2.3-3.1.94.93,2.49,1.75,2.65,2.8.16,1.02-1.08,2.27-2.32,4.52Z"/><path class="cls-1" d="M62.97,25.41c-1.96,1.28-3.24,2.74-4.09,2.52-1.01-.26-2.19-1.93-2.27-3.05-.05-.81,1.64-2.47,2.47-2.41,1.07.07,2.06,1.46,3.9,2.95Z"/><path class="cls-8" d="M14.89,56.18c4.82-3.22,9.32-6.24,13.82-9.23,4.46-2.97,14.27-2.9,18.71.08,4.39,2.95,8.8,5.88,13.74,9.17-1.38,3.65-2.61,7.77-4.45,11.59-2.12,4.4-6.14,6.29-10.90,6.41-5.3.13-10.62.18-15.92,0-5.77-.19-9.71-3.32-11.85-8.56-1.26-3.07-2.11-6.3-3.15-9.46Z"/></svg>`
        },
        link: 'https://www.caimogu.cc/circle/440.html',
        ariaLabel: 'Caimogu 社区'
      },
      {
        icon: {
          svg: `<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 80 80"><title>Afdian</title><defs><style>.afdian-cls-1{fill:#a683ee}.afdian-cls-2{fill:#9972e7}.afdian-cls-3{fill:#ab86f6}.afdian-cls-4{fill:#9a73e9}.afdian-cls-5{fill:#aa88f0}.afdian-cls-6{fill:none}.afdian-cls-7{fill:none}.afdian-cls-8{fill:#9972e7}</style></defs><g><path class="afdian-cls-7" d="M40,79.95c-12.46,0-24.91-.05-37.36.05-2,.02-2.63-.24-2.62-2.48C.12,52.59.13,27.66,0,2.73-.01.21.7,0,2.88,0c24.74.08,49.49.08,74.23,0,2.18,0,2.9.21,2.88,2.73-.13,24.93-.12,49.85-.01,74.78,0,2.25-.62,2.5-2.62,2.48-12.45-.11-24.91-.05-37.36-.05Z"/><path class="afdian-cls-3" d="M70.98,34.91c3.14,3.76,2.41,8.17,1.58,12.32-.47,2.37-.29,3.6,1.81,4.8,1.96,1.12,3.39,2.89,2.35,5.37-1.09,2.59-3.54,3.28-5.82,2.49-2.96-1.03-4.46.41-6.4,2.13-10.05,8.91-31.96,9.23-42.3.67-2.41-2-4.77-4.18-4.95-7.69,1.34-.6,2.7-.67,4.06-.05,9.39,10.49,21.02,10.76,33.4,7.2,3.72-1.07,7.23-2.66,8.38-7,.26-.99.96-1.76,2.2-1.57,1.28,1.1,2.86,1.43,4.82,1.67-1.61-.43-3.05-.31-4.14-1.25-1.9-1.21-4.17-3.15-1.43-4.75,4.59-2.69,4.31-6.37,3.73-10.51-.07-.48.03-.97.16-1.45.54-1.13,1.37-1.94,2.56-2.36Z"/><path class="afdian-cls-4" d="M20.15,54.81c-.87,1.62-1.9.65-2.89.18-1.21-5.09.51-9.08,4.54-12.24,1.08-.85,2.18-1.34,1.71-3.49-.9-4.13,1.03-5.46,5.44-4.33,1.4.36,3.34,1.46,3.65-.64.28-1.89-1.98-1.03-3.09-1.25-4.51-.9-9.16-1.16-13.47-3.01-.76-.92-.91-1.91-.35-2.99,1.62-1.5,3.46-.84,5.19-.39,4.99,1.29,10.23,1.35,15.12,3.07,1.93.68,3.09-.77,4.57-1.38,1.95-.8,4.32-2.33,5.69.25,1.36,2.55-1.15,3.86-2.94,4.96-3.96,2.44-7.82,5.04-11.7,7.62-5.15,3.44-10.01,7.09-11.48,13.63Z"/><path class="afdian-cls-8" d="M16.04,27.12c0,.97,0,1.95,0,2.92-4.52-.19-8.19-2.2-11.19-5.47-3.25-3.54-2.81-7.4,1.24-10.03,3.38-2.19,7.21-3.23,11.22-3.51,2-.14,4.37-.25,5,2.12.58,2.2-1.68,2.92-3.18,3.82-.83.5-1.81.76-2.73,1.12-1.2,1.61.46,1.4,1.05,1.39,4.51-.12,9.05.53,13.54-.34,2-.03,4.01-.07,6.01-.1.27,2.05-1.14,2.96-2.61,3.82-2.74.87-5.58.53-8.38.62-3.25-.16-6.5-.03-9.74-.09-2.83-.04-5.66-.15-8.09-1.71,2.09,2.51,5.54,3.13,7.86,5.44Z"/><path class="afdian-cls-2" d="M35,21.95c-.13-1.51,1.41-1.88,2-2.91,14.46-1.43,26.21,2.96,33.98,15.87-.1,1.37-.83,2.1-2.2,2.17-1.8.03-2.5-1.43-3.38-2.58-5.79-7.47-13.57-10.78-22.83-11.18-2.56-.11-5.35.77-7.56-1.37Z"/><path class="afdian-cls-2" d="M30.99,19.14c-4.71,1.87-9.6.63-14.41.75-1.25.03-1.55-1.02-.19-1.79,4.73,2.2,9.76.27,14.59,1.05Z"/><path class="afdian-cls-7" d="M35,21.95c3.98.12,8-.09,11.92.43,9.63,1.28,16.85,6.41,21.86,14.7,1.34,3.48,1.61,6.97.19,10.49-.35.87-.43,2-1.74,2-5.81,0-1.82,2.63-1.19,4.37l-.1.13c-.47.14-1.34.22-1.37.42-1.07,7.27-7.16,8.36-12.55,9.85-8.21,2.27-16.33,1.32-24.15-2.07-3.49-1.51-5.7-4.39-7.72-7.45-.61-4.34,1.06-7.41,4.6-10.06,5.98-4.47,12.09-8.7,18.44-12.61,1.27-.78,3.68-1.45,2.45-3.52-1.02-1.71-2.76-.28-3.88.53-2.59,1.86-4.96,2.04-8.2,1.12-5.69-1.60-11.67-2.16-17.52-3.16-6.38-1.33-9.3-3.89-9.57-9.31,2.23,3.64,5.04,4.71,8.45,4.27,3.77.75,7.55.71,11.32.03,2.92-.05,5.84-.11,8.76-.16Z"/><path class="afdian-cls-6" d="M66.03,53.94c2.60.24,5.52-.65,8.03,2.37-3.61.85-6.09.11-8.14-2.25,0,0,.1-.13.1-.13Z"/><path class="afdian-cls-2" d="M26.24,22.11c-3.78,1.11-7.55,1.14-11.32-.03,3.77.01,7.55.02,11.32.03Z"/><path class="afdian-cls-5" d="M30.52,47.06c.93-.03,1.64.45,1.81,1.28.22,1.10-.45,1.86-1.52,2.08-.97.20-1.53-.47-1.72-1.29-.25-1.11.24-1.87,1.42-2.07Z"/><path class="afdian-cls-1" d="M48.94,54c0,.76-.47,1.38-1.33,1.58-.98.24-1.53-.42-1.67-1.25-.18-1.06.23-2.02,1.43-2.03.81,0,1.45.60,1.57,1.70Z"/></g></svg>`
        },
        link: 'https://afdian.com/a/Zelbert',
        ariaLabel: 'Afdian 社区'
      }
    ],

    // 本地化翻译字段（直接放在 themeConfig 中）
    editLink: {
      text: '编辑此页',
      pattern: 'https://github.com/ZelbertYQ/MOD-TechDoc/edit/main/docs/:path'
    },
    lastUpdated: {
      text: '最后更新于',
      formatOptions: {
        dateStyle: 'full',
        timeStyle: 'medium'
      }
    },
    docFooter: {
      prev: '上一页',
      next: '下一页'
    },
    darkModeSwitchLabel: '切换主题',
    sidebarMenuLabel: '菜单',
    returnToTopLabel: '返回顶部',
    langMenuLabel: '切换语言',
    notFound: {
      title: '页面未找到',
      quote: '抱歉，页面不存在。',
      linkText: '返回主页'
    },
    outlineTitle: '页面导航',
    //页脚
    footer: {
      message: '不辨真伪，勿论虚实；囿于求知，身陷囹圄',
      copyright: 'Made By ZelbertYQ'
    }
  }
})
